app/views/patients/_form.html.erb

    <%= f.label :doctor_id %><br>
    <%= f.collection_select :doctor_id, Doctor.all, :id, :name, include_blank:true %>
---
SELECT "doctors".* FROM "doctors"