app/views/doctors/show.html.erb

SELECT "patients".* FROM "patients" WHERE "patients"."doctor_id" = ?  [["doctor_id", 2]]
---
	<ul>
	<% @doctor.patients.each do |patient| %>