app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "specialty", "phone", "available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dave"], ["specialty", "php"], ["phone", "44455512345"], ["available", "t"], ["created_at", "2016-04-27 00:37:10.312610"], ["updated_at", "2016-04-27 00:37:10.312610"]]
---
  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save

UPDATE "doctors" SET "available" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["available", "f"], ["updated_at", "2016-04-27 22:30:43.942466"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @doctor.update(doctor_params)