app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("pet_name", "pet_type", "notes", "healthy", "doctor_id", "date_in", "date_out", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "pet_name" = ?, "pet_type" = ?, "notes" = ?, "doctor_id" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["pet_name", "aba"], ["pet_type", "bcb"], ["notes", "dddd"], ["doctor_id", 2], ["updated_at", "2016-04-27 22:38:14.931054"], ["id", 3]]